app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."state" = ?  [["user_id", 2], ["state", "to_do"]]
---
  def index
    @to_do = current_user.tasks.where(state: "to_do")

INSERT INTO "tasks" ("content", "content_html", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hello everyone "], ["content_html", "<p>Hello everyone </p>"], ["user_id", 1], ["created_at", "2015-02-06 22:57:43.352685"], ["updated_at", "2015-02-06 22:57:43.352685"]]
---
  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "content" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["content", "Tasks 2"], ["updated_at", "2015-02-06 12:05:10.807860"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

UPDATE "tasks" SET "state" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["state", "doing"], ["updated_at", "2015-02-06 17:53:21.432445"], ["id", 5]]
---
  def change
    @task.update_attributes(state: params[:state])